
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 14 to add, 1 to change, 14 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES_HOST
* Replace
  * module.opal_postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.opal_postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.opal_postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.opal_postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.enable_temp_tablespaces_on_local_ssd&#34;]
  * module.opal_postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.opal_postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;logfiles.download_enable&#34;]
  * module.opal_postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;logfiles.retention_days&#34;]
  * module.opal_postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;psql-opal-fines-db&#34;]
  * module.opal_postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;psql-opal-maintenance-db&#34;]
  * module.opal_postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;psql-opal-user-db&#34;]
  * module.opal_postgresql.azurerm_resource_group.rg[0]
  * module.opal_postgresql.null_resource.set-user-permissions-additionaldbs[&#34;psql-opal-fines-db&#34;]
  * module.opal_postgresql.null_resource.set-user-permissions-additionaldbs[&#34;psql-opal-maintenance-db&#34;]
  * module.opal_postgresql.null_resource.set-user-permissions-additionaldbs[&#34;psql-opal-user-db&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://opal-stg.vault.azure.net/secrets/null-POSTGRES-HOST/f846bc54c97d454b8f7789210da498eb"
        name                    = "null-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.opal_postgresql.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ fqdn                          = "opal-null-stg.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg" -> (known after apply)
      ~ name                          = "opal-null-stg" -> "opal-db-stg" # forces replacement
      ~ resource_group_name           = "opal-null-data-stg" -> "opal-db-data-stg" # forces replacement
      ~ storage_tier                  = "P6" -> (known after apply)
        tags                          = {
            "application"         = "opal"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/opal-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#opal-help"
            "environment"         = "staging"
            "managedBy"           = "Green on Black"
        }
      - zone                          = "1" -> null
        # (14 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.opal_postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg/administrators/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ resource_group_name = "opal-null-data-stg" -> "opal-db-data-stg" # forces replacement
      ~ server_name         = "opal-null-stg" -> "opal-db-stg" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.opal_postgresql.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg/administrators/7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> (known after apply)
      ~ resource_group_name = "opal-null-data-stg" -> "opal-db-data-stg" # forces replacement
      ~ server_name         = "opal-null-stg" -> "opal-db-stg" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.opal_postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.enable_temp_tablespaces_on_local_ssd"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg/configurations/azure.enable_temp_tablespaces_on_local_ssd" -> (known after apply)
        name      = "azure.enable_temp_tablespaces_on_local_ssd"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.opal_postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.opal_postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["logfiles.download_enable"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg/configurations/logfiles.download_enable" -> (known after apply)
        name      = "logfiles.download_enable"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.opal_postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["logfiles.retention_days"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg/configurations/logfiles.retention_days" -> (known after apply)
        name      = "logfiles.retention_days"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.opal_postgresql.azurerm_postgresql_flexible_server_database.pg_databases["psql-opal-fines-db"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg/databases/psql-opal-fines-db" -> (known after apply)
        name      = "psql-opal-fines-db"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.opal_postgresql.azurerm_postgresql_flexible_server_database.pg_databases["psql-opal-maintenance-db"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg/databases/psql-opal-maintenance-db" -> (known after apply)
        name      = "psql-opal-maintenance-db"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.opal_postgresql.azurerm_postgresql_flexible_server_database.pg_databases["psql-opal-user-db"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg/databases/psql-opal-user-db" -> (known after apply)
        name      = "psql-opal-user-db"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-null-stg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.opal_postgresql.azurerm_resource_group.rg[0] must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-null-data-stg" -> (known after apply)
      ~ name       = "opal-null-data-stg" -> "opal-db-data-stg" # forces replacement
        tags       = {
            "application"         = "opal"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/opal-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#opal-help"
            "environment"         = "staging"
            "managedBy"           = "Green on Black"
        }
        # (2 unchanged attributes hidden)
    }

  # module.opal_postgresql.null_resource.set-user-permissions-additionaldbs["psql-opal-fines-db"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "7937562905200957482" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "name"           = "opal-null" -> "opal-db"
            # (3 unchanged elements hidden)
        }
    }

  # module.opal_postgresql.null_resource.set-user-permissions-additionaldbs["psql-opal-maintenance-db"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "8041750125732335477" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "name"           = "opal-null" -> "opal-db"
            # (3 unchanged elements hidden)
        }
    }

  # module.opal_postgresql.null_resource.set-user-permissions-additionaldbs["psql-opal-user-db"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "1904937045364652844" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "name"           = "opal-null" -> "opal-db"
            # (3 unchanged elements hidden)
        }
    }

Plan: 14 to add, 1 to change, 14 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->